cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "1995-02-01"], ["color", "audi"], ["name", "a"], ["sex", "on"], ["created_at", "2019-01-29 23:16:27.746632"], ["updated_at", "2019-01-29 23:16:27.746632"]]
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save